torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723bu/core/efuse/rtw_efuse.c
	_rtw_memset(source_addr, 0, 18);
	_rtw_memset(pHalData->EEPROMMACAddr, 0, ETH_ALEN);

	fp = filp_open("/data/wifimac.txt", O_RDWR,  0644);
	if (IS_ERR(fp)) {
		pHalData->bloadmac_fail_flag = _TRUE;
		DBG_871X("Error, wifi mac address file doesn't exist.\n");
	} else {
		fs = get_fs();
		set_fs(KERNEL_DS);

		DBG_871X("wifi mac address:\n");
		vfs_read(fp, source_addr, 18, &pos);
		source_addr[17] = ':';

		head = end = source_addr;
		for (i=0; i<ETH_ALEN; i++) {
			while (end && (*end != ':') )
				end++;

			if (end && (*end == ':') )
				*end = '\0';

			pHalData->EEPROMMACAddr[i] = simple_strtoul(head, NULL, 16 );

			if (end) {
				end++;
				head = end;
			}
			DBG_871X("%02x \n", pHalData->EEPROMMACAddr[i]);
		}
		DBG_871X("\n");
		set_fs(fs);
		pHalData->bloadmac_fail_flag = _FALSE;
		filp_close(fp, NULL);
	}

	if ( (_rtw_memcmp(pHalData->EEPROMMACAddr, null_mac_addr, ETH_ALEN)) ||
		(_rtw_memcmp(pHalData->EEPROMMACAddr, multi_mac_addr, ETH_ALEN)) ) {
		pHalData->EEPROMMACAddr[0] = 0x00;
		pHalData->EEPROMMACAddr[1] = 0xe0;
		pHalData->EEPROMMACAddr[2] = 0x4c;
		pHalData->EEPROMMACAddr[3] = (u8)(curtime & 0xff) ;
		pHalData->EEPROMMACAddr[4] = (u8)((curtime>>8) & 0xff) ;
		pHalData->EEPROMMACAddr[5] = (u8)((curtime>>16) & 0xff) ;
	}

	DBG_871X("Hal_ReadMACAddrFromFile: Permanent Address = %02x-%02x-%02x-%02x-%02x-%02x !!!\n",
		  pHalData->EEPROMMACAddr[0], pHalData->EEPROMMACAddr[1],
		  pHalData->EEPROMMACAddr[2], pHalData->EEPROMMACAddr[3],
		  pHalData->EEPROMMACAddr[4], pHalData->EEPROMMACAddr[5]);
}


u32 Rtw_Hal_readPGDataFromConfigFile(PADAPTER	padapter)
{
	u32 i;
	struct file *fp;
	mm_segment_t fs;
	u8 temp[3];
	loff_t pos = 0;
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);
	u8	*PROMContent = pHalData->efuse_eeprom_data;


	temp[2] = 0; // add end of string '\0'

	fp = filp_open("/system/etc/wifi/wifi_efuse.map", O_RDWR,  0644);
	if (IS_ERR(fp)) {
		pHalData->bloadfile_fail_flag = _TRUE;
		DBG_871X("Error, Efuse configure file doesn't exist.\n");
		return _FAIL;
	}

	fs = get_fs();
	set_fs(KERNEL_DS);

	DBG_871X("Efuse configure file:\n");
	for (i=0; i< EFUSE_MAP_SIZE  ; i++) {
		vfs_read(fp, temp, 2, &pos);
		PROMContent[i] = simple_strtoul(temp, NULL, 16 );
		pos += 1; // Filter the space character
		DBG_871X("%02X \n", PROMContent[i]);
	}
	DBG_871X("\n");
	set_fs(fs);

	filp_close(fp, NULL);
	
	pHalData->bloadfile_fail_flag = _FALSE;
	
	return _SUCCESS;
}

#endif //#CONFIG_EFUSE_CONFIG_FILE
